tutorials/fluidSolidInteraction/blockInTreacle/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          fsiProperties;
}

fluidSolidInterface NewtonQuasiMonolithic;

NewtonQuasiMonolithicCoeffs
{
    solidPatch      interface;
    fluidPatch      cylinder;
    fluidSystemScaleFactor 1e+08;
    coupled         yes;
    interfaceTransferMethod directMap;
    writeResidualsToFile yes;
    passViscousStress yes;
    optionsFile petscOptions.lu;
    //optionsFile petscOptions.mf_fieldsplit;
}


// ************************************************************************* //
