tutorials/fluidSolidInteraction/blockInTreacle/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    D
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_max_it "100";
            snes_monitor;
            snes_converged_reason;

            snes_mf;
            snes_mf_operator;

            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_converged_reason;

            pc_type bjacobi;
            sub_pc_type lu;

            snes_lag_preconditioner_persists true;
            snes_lag_preconditioner "-2";
        }
    }
}

// relaxationFactors
// {
//     equations
//     {
//         //"D|DD"   0.999;
//     }
//     fields
//     {
//         "DD|D" 0.9;
//     }
// }

// ************************************************************************* //
